app/views/pets/show.html.erb

SELECT "vet_appointments".* FROM "vet_appointments"  WHERE "vet_appointments"."pet_id" = $1  [["pet_id", 1]]
---
  <ol>
    <% @pet.vet_appointments.each do |vet_appointment| %>