app/views/vet_appointments/_form.html.erb

SELECT "veterinarians".* FROM "veterinarians"
---
    <div class="form-group">
      <%= f.collection_select :veterinarian_id, Veterinarian.all, :id, :name %>