app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets"  WHERE "pets"."user_id" = $1  [["user_id", 32]]
---
  def index
    @pets = current_user.pets.all

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @pet = Pet.find(params[:id])

INSERT INTO "pets" ("age", "created_at", "kind", "name", "updated_at", "weight") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["age", 10], ["created_at", "2014-09-02 18:57:33.236457"], ["kind", "Dog"], ["name", "KC"], ["updated_at", "2014-09-02 18:57:33.236457"], ["weight", 18]]
SELECT "pets".* FROM "pets"
---
  def create
    binding.pry
    @pet = Pet.new(pet_params)
    if @pet.save
      flash[:notice] = "#{@pet.name} was added to the Pet Tracker."
      redirect_to pet_path(@pet)
    else
      @pets = Pet.all

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @pet = Pet.find(params[:id])

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "pets" SET "kind" = $1, "updated_at" = $2 WHERE "pets"."id" = 1  [["kind", "Dog"], ["updated_at", "2014-09-02 22:22:49.080141"]]
---
  def update
    @pet = Pet.find(params[:id])
    if @pet.update(pet_params)

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 2]]
---
  def destroy
    @pet = Pet.find(params[:id])
    @pet.destroy