app/controllers/vet_appointments_controller.rb

SELECT "veterinarians".* FROM "veterinarians"
SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @veterinarians = Veterinarian.all
    @pet = Pet.find(params[:pet_id])

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "vet_appointments" ("cost", "created_at", "date", "description", "note", "pet_id", "updated_at", "veterinarian_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "veterinarians".* FROM "veterinarians"
---
  def create
    @pet = Pet.find(params[:pet_id])
    @vet_appointment = VetAppointment.new(params[:vet_appointment])
    if @vet_appointment.save
      flash[:notice] = "Your vet appointment was added to the Pet Tracker."
      redirect_to pet_path(@pet)
    else
      @veterinarians = Veterinarian.all

SELECT "veterinarians".* FROM "veterinarians"
SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "vet_appointments".* FROM "vet_appointments"  WHERE "vet_appointments"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @veterinarians = Veterinarian.all
    @pet = Pet.find(params[:pet_id])
    @vet_appointment = VetAppointment.find(params[:vet_appointment_id])

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "vet_appointments".* FROM "vet_appointments"  WHERE "vet_appointments"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "vet_appointments" SET "cost" = $1, "updated_at" = $2 WHERE "vet_appointments"."id" = 3  [["cost", 150], ["updated_at", "2014-09-02 22:15:59.475581"]]
---
  def update
    @pet = Pet.find(params[:pet_id])
    @vet_appointment = VetAppointment.find(params[:vet_appointment_id])
    if @vet_appointment.update(params[:vet_appointment])

SELECT  "vet_appointments".* FROM "vet_appointments"  WHERE "vet_appointments"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "vet_appointments" WHERE "vet_appointments"."id" = $1  [["id", 3]]
SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    @vet_appointment = VetAppointment.find(params[:vet_appointment_id])
    @vet_appointment.destroy
    @pet = Pet.find(params[:pet_id])