app/controllers/veterinarians_controller.rb

  def index
    @veterinarians = current_user.veterinarians.all
---
SELECT "veterinarians".* FROM "veterinarians"

  def show
    @veterinarian = Veterinarian.find(params[:id])
---
SELECT  "veterinarians".* FROM "veterinarians"  WHERE "veterinarians"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @veterinarian = Veterinarian.new(veterinarian_params)
    if @veterinarian.save
---
INSERT INTO "veterinarians" ("address", "created_at", "email", "name", "phone", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @veterinarian = Veterinarian.find(params[:id])
---
SELECT  "veterinarians".* FROM "veterinarians"  WHERE "veterinarians"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @veterinarian = Veterinarian.find(params[:id])
    if @veterinarian.update(veterinarian_params)
---
SELECT  "veterinarians".* FROM "veterinarians"  WHERE "veterinarians"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "veterinarians" SET "phone" = $1, "updated_at" = $2 WHERE "veterinarians"."id" = 1  [["phone", 5032005555], ["updated_at", "2014-09-02 20:42:10.789467"]]

  def destroy
    @veterinarian = Veterinarian.find(params[:id])
    @veterinarian.destroy
---
SELECT  "veterinarians".* FROM "veterinarians"  WHERE "veterinarians"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "veterinarians" WHERE "veterinarians"."id" = $1  [["id", 1]]